proxy-server/artillery.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 5
    - duration: 60
      arrivalRate: 5
      rampTo: 50
    - duration: 60
      arrivalRate: 50
      rampTo: 100
scenarios:
  - name: "Get updates"
    flow:
      - get:
          url: "/api/update/10000000"